# Спортсмен занимается ежедневными пробежками. В первый день его результат составил "a" километров. Каждый день
# спортсмен увеличивал результат на 10% относительно предыдущего. Требуется определить номер дня, на который результат
# спортсмена составит не менее "b" километров. Программа должна принимать значения параметров "a" и "b" и выводить
# одно натуральное число - номер дня.
a = int(input('Результат первого дня: '))
b = int(input('Желаемый результат: '))
day = 1
print(f'{day}-й день: {round(a, 2)}')
while a < b:
    a *= 1.1
    day += 1
    print(f'{day}-й день: {round(a, 2)}')
print(f'На {day}-й день спортсмен достиг желаемого результата - не менее {b} км.')
